reference-adapter/pspcl-ifix-adapter/src/test/resources/test-data/fetch_pspcl_bill_req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GetBills xmlns="http://tempuri.org/">
            <accountNo>3005754414</accountNo>
        </GetBills>
    </soap:Body>
</soap:Envelope>